иб/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

иб/src/Catalogs/Валюты/Валюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Валюты</name>
  <predefined>
    <items>
      <name>Евро</name>
      <description>EUR</description>
    </items>
    <items>
      <name>Доллар</name>
      <description>USD</description>
    </items>
    <items>
      <name>Рубль</name>
      <description>руб.</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

иб/src/InformationRegisters/КурсыВалют/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ЗагрузитьКурсы(Команда)
	ОткрытьФормуМодально("Обработка.ЗагрузкаКурсовВалют.Форма",,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	АвтоЗагрузка();
	
	ПостроениеГрафиков();
	
КонецПроцедуры

Процедура АвтоЗагрузка()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	КурсыВалютСрезПоследних.Период,
	|	КурсыВалютСрезПоследних.Валюта
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютСрезПоследних";
	Результат = Запрос.Выполнить();
	Стр = Результат.Выбрать();
	
	Пока Стр.Следующий() Цикл
		Если НачалоДня(Стр.Период)<НачалоДня(ТекущаяДата()) Тогда
			СписокВалют=Новый ТаблицаЗначений;
			СписокВалют.Колонки.Добавить("Валюта");
			СписокВалют.Колонки.Добавить("КодВалюты");
			СписокВалют.Колонки.Добавить("ДатаКурса");
			СписокВалют.Колонки.Добавить("Курс");
			СтрТабл=СписокВалют.Добавить();
			СтрТабл.Валюта=Справочники.Валюты.Евро;
			СтрТабл.КодВалюты=Справочники.Валюты.Евро.Код;
			СтрТабл=СписокВалют.Добавить();
			СтрТабл.Валюта=Справочники.Валюты.Доллар;
			СтрТабл.КодВалюты=Справочники.Валюты.Доллар.Код;
			
			ДатаНачЗагрузки=КонецДня(Стр.Период)+10;
			ФункцииКлиентСервер.ЗагрузитьКурсыВалютПоПараметрам(СписокВалют,НачалоДня(ДатаНачЗагрузки),НачалоДня(ТекущаяДата()));
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
    &НаСервере
Процедура ПостроениеГрафиков()
	
	ГрафикЕвроДол.ТипДиаграммы=ТипДиаграммы.График;//.ГистограммаГоризонтальная;
	ГрафикЕвроДол.ОбластьПостроения.ОтображатьЛинииЗначенийШкалы=Ложь;
	
	ГрафикЕвро.ТипДиаграммы=ТипДиаграммы.График;
	ГрафикЕвро.ОбластьПостроения.ОтображатьЛинииЗначенийШкалы=Ложь;
	
	ГрафикДоллар.ТипДиаграммы=ТипДиаграммы.График;
	ГрафикДоллар.ОбластьПостроения.ОтображатьЛинииЗначенийШкалы=Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РегистрСведенийКурсыВалют.Период КАК Период,
	|	РегистрСведенийКурсыВалют.Валюта КАК Доллары,
	|	РегистрСведенийКурсыВалют.Курс КАК КурсДоллары,
	|	ВложенныйЗапрос.Валюта КАК Евро,
	|	ВложенныйЗапрос.Курс КАК КурсЕвро
	|ИЗ
	|	РегистрСведений.КурсыВалют КАК РегистрСведенийКурсыВалют
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			КурсыВалют.Период КАК Период,
	|			КурсыВалют.Валюта КАК Валюта,
	|			КурсыВалют.Курс КАК Курс
	|		ИЗ
	|			РегистрСведений.КурсыВалют КАК КурсыВалют
	|		ГДЕ
	|			КурсыВалют.Валюта = &Евро) КАК ВложенныйЗапрос
	|		ПО РегистрСведенийКурсыВалют.Период = ВложенныйЗапрос.Период
	|ГДЕ
	|	РегистрСведенийКурсыВалют.Период МЕЖДУ &ДатНач И &ДатКон
	|	И РегистрСведенийКурсыВалют.Валюта = &Доллары
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	ДатаНач=ТекущаяДата()-60*60*24*30; //30 дней
	Запрос.УстановитьПараметр("ДатНач",ДатаНач);
	Запрос.УстановитьПараметр("ДатКон",ТекущаяДата());
	Запрос.УстановитьПараметр("Евро",Справочники.Валюты.Евро);
	Запрос.УстановитьПараметр("Доллары",Справочники.Валюты.Доллар);
	
	Результат = Запрос.Выполнить();
	Стр = Результат.Выбрать();
	
	Пока Стр.Следующий() Цикл
		Серия=ГрафикЕвроДол.УстановитьСерию("EUR/USD");//Валюта 
		Серия.Маркер=ТипМаркераДиаграммы.Нет;
		Точка=ГрафикЕвроДол.УстановитьТочку(Лев(Стр.Период,2)); 
		ГрафикЕвроДол.УстановитьЗначение(Точка,Серия,Стр.КурсЕвро/Стр.КурсДоллары-Константы.НормализаторЕвроДолл.Получить());//нормализация 1.3
		
		Серия=ГрафикЕвро.УстановитьСерию(Стр.Евро);//Валюта 
		Серия.Маркер=ТипМаркераДиаграммы.Нет;
		Точка=ГрафикЕвро.УстановитьТочку(Лев(Стр.Период,2)); 
		ГрафикЕвро.УстановитьЗначение(Точка,Серия,Стр.КурсЕвро-Константы.НормализаторЕвро.Получить());//Курс 
		
		Серия=ГрафикДоллар.УстановитьСерию(Стр.Доллары);//Валюта 
		Серия.Маркер=ТипМаркераДиаграммы.Нет;
		Точка=ГрафикДоллар.УстановитьТочку(Лев(Стр.Период,2)); 
		ГрафикДоллар.УстановитьЗначение(Точка,Серия,Стр.КурсДоллары-Константы.НормализаторДоллара.Получить());//Курс 
	КонецЦикла;
	
КонецПроцедуры
